GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.h
extern volatile CCDPCbits_t CCDPCbits __at(0x3A68);
// bitfield macros
#define _CCDPC_CCDPC0_POSN                                  0x0
#define _CCDPC_CCDPC0_POSITION                              0x0
#define _CCDPC_CCDPC0_SIZE                                  0x1
#define _CCDPC_CCDPC0_LENGTH                                0x1
#define _CCDPC_CCDPC0_MASK                                  0x1
#define _CCDPC_CCDPC1_POSN                                  0x1
#define _CCDPC_CCDPC1_POSITION                              0x1
#define _CCDPC_CCDPC1_SIZE                                  0x1
#define _CCDPC_CCDPC1_LENGTH                                0x1
#define _CCDPC_CCDPC1_MASK                                  0x2
#define _CCDPC_CCDPC2_POSN                                  0x2
#define _CCDPC_CCDPC2_POSITION                              0x2
#define _CCDPC_CCDPC2_SIZE                                  0x1
#define _CCDPC_CCDPC2_LENGTH                                0x1
#define _CCDPC_CCDPC2_MASK                                  0x4
#define _CCDPC_CCDPC3_POSN                                  0x3
#define _CCDPC_CCDPC3_POSITION                              0x3
#define _CCDPC_CCDPC3_SIZE                                  0x1
#define _CCDPC_CCDPC3_LENGTH                                0x1
#define _CCDPC_CCDPC3_MASK                                  0x8
#define _CCDPC_CCDPC4_POSN                                  0x4
#define _CCDPC_CCDPC4_POSITION                              0x4
#define _CCDPC_CCDPC4_SIZE                                  0x1
#define _CCDPC_CCDPC4_LENGTH                                0x1
#define _CCDPC_CCDPC4_MASK                                  0x10
#define _CCDPC_CCDPC5_POSN                                  0x5
#define _CCDPC_CCDPC5_POSITION                              0x5
#define _CCDPC_CCDPC5_SIZE                                  0x1
#define _CCDPC_CCDPC5_LENGTH                                0x1
#define _CCDPC_CCDPC5_MASK                                  0x20
#define _CCDPC_CCDPC6_POSN                                  0x6
#define _CCDPC_CCDPC6_POSITION                              0x6
#define _CCDPC_CCDPC6_SIZE                                  0x1
#define _CCDPC_CCDPC6_LENGTH                                0x1
#define _CCDPC_CCDPC6_MASK                                  0x40
#define _CCDPC_CCDPC7_POSN                                  0x7
#define _CCDPC_CCDPC7_POSITION                              0x7
#define _CCDPC_CCDPC7_SIZE                                  0x1
#define _CCDPC_CCDPC7_LENGTH                                0x1
#define _CCDPC_CCDPC7_MASK                                  0x80

// Register: CCDNC
#define CCDNC CCDNC
extern volatile unsigned char           CCDNC               __at(0x3A69);
#ifndef _LIB_BUILD
asm("CCDNC equ 03A69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNC0                 :1;
        unsigned CCDNC1                 :1;
        unsigned CCDNC2                 :1;
        unsigned CCDNC3                 :1;
        unsigned CCDNC4                 :1;
        unsigned CCDNC5                 :1;
        unsigned CCDNC6                 :1;
        unsigned CCDNC7                 :1;
    };
} CCDNCbits_t;
extern volatile CCDNCbits_t CCDNCbits __at(0x3A69);
// bitfield macros
#define _CCDNC_CCDNC0_POSN                                  0x0
#define _CCDNC_CCDNC0_POSITION                              0x0
#define _CCDNC_CCDNC0_SIZE                                  0x1
#define _CCDNC_CCDNC0_LENGTH                                0x1
#define _CCDNC_CCDNC0_MASK                                  0x1
#define _CCDNC_CCDNC1_POSN                                  0x1
#define _CCDNC_CCDNC1_POSITION                              0x1
#define _CCDNC_CCDNC1_SIZE                                  0x1
#define _CCDNC_CCDNC1_LENGTH                                0x1
#define _CCDNC_CCDNC1_MASK                                  0x2
#define _CCDNC_CCDNC2_POSN                                  0x2
#define _CCDNC_CCDNC2_POSITION                              0x2
#define _CCDNC_CCDNC2_SIZE                                  0x1
#define _CCDNC_CCDNC2_LENGTH                                0x1
#define _CCDNC_CCDNC2_MASK                                  0x4
#define _CCDNC_CCDNC3_POSN                                  0x3
#define _CCDNC_CCDNC3_POSITION                              0x3
#define _CCDNC_CCDNC3_SIZE                                  0x1
#define _CCDNC_CCDNC3_LENGTH                                0x1
#define _CCDNC_CCDNC3_MASK                                  0x8
#define _CCDNC_CCDNC4_POSN                                  0x4
#define _CCDNC_CCDNC4_POSITION                              0x4
#define _CCDNC_CCDNC4_SIZE                                  0x1
#define _CCDNC_CCDNC4_LENGTH                                0x1
#define _CCDNC_CCDNC4_MASK                                  0x10
#define _CCDNC_CCDNC5_POSN                                  0x5
#define _CCDNC_CCDNC5_POSITION                              0x5
#define _CCDNC_CCDNC5_SIZE                                  0x1
#define _CCDNC_CCDNC5_LENGTH                                0x1
#define _CCDNC_CCDNC5_MASK                                  0x20
#define _CCDNC_CCDNC6_POSN                                  0x6
#define _CCDNC_CCDNC6_POSITION                              0x6
#define _CCDNC_CCDNC6_SIZE                                  0x1
#define _CCDNC_CCDNC6_LENGTH                                0x1
#define _CCDNC_CCDNC6_MASK                                  0x40
#define _CCDNC_CCDNC7_POSN                                  0x7
#define _CCDNC_CCDNC7_POSITION                              0x7
#define _CCDNC_CCDNC7_SIZE                                  0x1
#define _CCDNC_CCDNC7_LENGTH                                0x1
#define _CCDNC_CCDNC7_MASK                                  0x80

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x3A6A);
#ifndef _LIB_BUILD
asm("RC3I2C equ 03A6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RC3I2Cbits_t;
extern volatile RC3I2Cbits_t RC3I2Cbits __at(0x3A6A);
// bitfield macros
#define _RC3I2C_TH_POSN                                     0x0
#define _RC3I2C_TH_POSITION                                 0x0
#define _RC3I2C_TH_SIZE                                     0x2
#define _RC3I2C_TH_LENGTH                                   0x2
#define _RC3I2C_TH_MASK                                     0x3
#define _RC3I2C_PU_POSN                                     0x4
#define _RC3I2C_PU_POSITION                                 0x4
#define _RC3I2C_PU_SIZE                                     0x2
#define _RC3I2C_PU_LENGTH                                   0x2
#define _RC3I2C_PU_MASK                                     0x30
#define _RC3I2C_SLEW_POSN                                   0x6
#define _RC3I2C_SLEW_POSITION                               0x6
#define _RC3I2C_SLEW_SIZE                                   0x1
#define _RC3I2C_SLEW_LENGTH                                 0x1
#define _RC3I2C_SLEW_MASK                                   0x40
#define _RC3I2C_TH0_POSN                                    0x0
#define _RC3I2C_TH0_POSITION                                0x0
#define _RC3I2C_TH0_SIZE                                    0x1
#define _RC3I2C_TH0_LENGTH                                  0x1
#define _RC3I2C_TH0_MASK                                    0x1
#define _RC3I2C_TH1_POSN                                    0x1
#define _RC3I2C_TH1_POSITION                                0x1
#define _RC3I2C_TH1_SIZE                                    0x1
#define _RC3I2C_TH1_LENGTH                                  0x1
#define _RC3I2C_TH1_MASK                                    0x2
#define _RC3I2C_PU0_POSN                                    0x4
#define _RC3I2C_PU0_POSITION                                0x4
#define _RC3I2C_PU0_SIZE                                    0x1
#define _RC3I2C_PU0_LENGTH                                  0x1
#define _RC3I2C_PU0_MASK                                    0x10
#define _RC3I2C_PU1_POSN                                    0x5
#define _RC3I2C_PU1_POSITION                                0x5
#define _RC3I2C_PU1_SIZE                                    0x1
#define _RC3I2C_PU1_LENGTH                                  0x1
#define _RC3I2C_PU1_MASK                                    0x20
#define _RC3I2C_I2CTH_POSN                                  0x0
#define _RC3I2C_I2CTH_POSITION                              0x0
#define _RC3I2C_I2CTH_SIZE                                  0x2
#define _RC3I2C_I2CTH_LENGTH                                0x2
#define _RC3I2C_I2CTH_MASK                                  0x3
#define _RC3I2C_I2CPU_POSN                                  0x4
#define _RC3I2C_I2CPU_POSITION                              0x4
#define _RC3I2C_I2CPU_SIZE                                  0x2
#define _RC3I2C_I2CPU_LENGTH                                0x2
#define _RC3I2C_I2CPU_MASK                                  0x30
#define _RC3I2C_I2CSLEW_POSN                                0x6
#define _RC3I2C_I2CSLEW_POSITION                            0x6
#define _RC3I2C_I2CSLEW_SIZE                                0x1
#define _RC3I2C_I2CSLEW_LENGTH                              0x1
#define _RC3I2C_I2CSLEW_MASK                                0x40
#define _RC3I2C_I2CTH0_POSN                                 0x0
#define _RC3I2C_I2CTH0_POSITION                             0x0
#define _RC3I2C_I2CTH0_SIZE                                 0x1
#define _RC3I2C_I2CTH0_LENGTH                               0x1
#define _RC3I2C_I2CTH0_MASK                                 0x1
#define _RC3I2C_I2CTH1_POSN                                 0x1
#define _RC3I2C_I2CTH1_POSITION                             0x1
#define _RC3I2C_I2CTH1_SIZE                                 0x1
#define _RC3I2C_I2CTH1_LENGTH                               0x1
#define _RC3I2C_I2CTH1_MASK                                 0x2
#define _RC3I2C_I2CPU0_POSN                                 0x4
#define _RC3I2C_I2CPU0_POSITION                             0x4
#define _RC3I2C_I2CPU0_SIZE                                 0x1
#define _RC3I2C_I2CPU0_LENGTH                               0x1
#define _RC3I2C_I2CPU0_MASK                                 0x10
#define _RC3I2C_I2CPU1_POSN                                 0x5
#define _RC3I2C_I2CPU1_POSITION                             0x5
#define _RC3I2C_I2CPU1_SIZE                                 0x1
#define _RC3I2C_I2CPU1_LENGTH                               0x1
#define _RC3I2C_I2CPU1_MASK                                 0x20

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x3A6B);
#ifndef _LIB_BUILD
asm("RC4I2C equ 03A6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x3A6B);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_PU_POSN                                     0x4
#define _RC4I2C_PU_POSITION                                 0x4
#define _RC4I2C_PU_SIZE                                     0x2
#define _RC4I2C_PU_LENGTH                                   0x2
#define _RC4I2C_PU_MASK                                     0x30
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x1
#define _RC4I2C_SLEW_LENGTH                                 0x1
#define _RC4I2C_SLEW_MASK                                   0x40
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_PU0_POSN                                    0x4
#define _RC4I2C_PU0_POSITION                                0x4
#define _RC4I2C_PU0_SIZE                                    0x1
#define _RC4I2C_PU0_LENGTH                                  0x1
#define _RC4I2C_PU0_MASK                                    0x10
#define _RC4I2C_PU1_POSN                                    0x5
#define _RC4I2C_PU1_POSITION                                0x5
#define _RC4I2C_PU1_SIZE                                    0x1
#define _RC4I2C_PU1_LENGTH                                  0x1
#define _RC4I2C_PU1_MASK                                    0x20
#define _RC4I2C_I2CTH_POSN                                  0x0
#define _RC4I2C_I2CTH_POSITION                              0x0
#define _RC4I2C_I2CTH_SIZE                                  0x2
#define _RC4I2C_I2CTH_LENGTH                                0x2
#define _RC4I2C_I2CTH_MASK                                  0x3
#define _RC4I2C_I2CPU_POSN                                  0x4
#define _RC4I2C_I2CPU_POSITION                              0x4
#define _RC4I2C_I2CPU_SIZE                                  0x2
#define _RC4I2C_I2CPU_LENGTH                                0x2
#define _RC4I2C_I2CPU_MASK                                  0x30
#define _RC4I2C_I2CSLEW_POSN                                0x6
#define _RC4I2C_I2CSLEW_POSITION                            0x6
#define _RC4I2C_I2CSLEW_SIZE                                0x1
#define _RC4I2C_I2CSLEW_LENGTH                              0x1
#define _RC4I2C_I2CSLEW_MASK                                0x40
#define _RC4I2C_I2CTH0_POSN                                 0x0
#define _RC4I2C_I2CTH0_POSITION                             0x0
#define _RC4I2C_I2CTH0_SIZE                                 0x1
#define _RC4I2C_I2CTH0_LENGTH                               0x1
#define _RC4I2C_I2CTH0_MASK                                 0x1
#define _RC4I2C_I2CTH1_POSN                                 0x1
#define _RC4I2C_I2CTH1_POSITION                             0x1
#define _RC4I2C_I2CTH1_SIZE                                 0x1
#define _RC4I2C_I2CTH1_LENGTH                               0x1
#define _RC4I2C_I2CTH1_MASK                                 0x2
#define _RC4I2C_I2CPU0_POSN                                 0x4
#define _RC4I2C_I2CPU0_POSITION                             0x4
#define _RC4I2C_I2CPU0_SIZE                                 0x1
#define _RC4I2C_I2CPU0_LENGTH                               0x1
#define _RC4I2C_I2CPU0_MASK                                 0x10
#define _RC4I2C_I2CPU1_POSN                                 0x5
#define _RC4I2C_I2CPU1_POSITION                             0x5
#define _RC4I2C_I2CPU1_SIZE                                 0x1
#define _RC4I2C_I2CPU1_LENGTH                               0x1
#define _RC4I2C_I2CPU1_MASK                                 0x20

// Register: ANSELD
#define ANSELD ANSELD
extern volatile unsigned char           ANSELD              __at(0x3A70);
#ifndef _LIB_BUILD
asm("ANSELD equ 03A70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELD0                :1;
        unsigned ANSELD1                :1;
        unsigned ANSELD2                :1;
        unsigned ANSELD3                :1;
        unsigned ANSELD4                :1;
        unsigned ANSELD5                :1;
        unsigned ANSELD6                :1;
        unsigned ANSELD7                :1;
    };
} ANSELDbits_t;
extern volatile ANSELDbits_t ANSELDbits __at(0x3A70);
// bitfield macros
#define _ANSELD_ANSELD0_POSN                                0x0
#define _ANSELD_ANSELD0_POSITION                            0x0
#define _ANSELD_ANSELD0_SIZE                                0x1
#define _ANSELD_ANSELD0_LENGTH                              0x1
#define _ANSELD_ANSELD0_MASK                                0x1
#define _ANSELD_ANSELD1_POSN                                0x1
#define _ANSELD_ANSELD1_POSITION                            0x1
#define _ANSELD_ANSELD1_SIZE                                0x1
#define _ANSELD_ANSELD1_LENGTH                              0x1
#define _ANSELD_ANSELD1_MASK                                0x2
#define _ANSELD_ANSELD2_POSN                                0x2
#define _ANSELD_ANSELD2_POSITION                            0x2
#define _ANSELD_ANSELD2_SIZE                                0x1
#define _ANSELD_ANSELD2_LENGTH                              0x1
#define _ANSELD_ANSELD2_MASK                                0x4
#define _ANSELD_ANSELD3_POSN                                0x3
#define _ANSELD_ANSELD3_POSITION                            0x3
#define _ANSELD_ANSELD3_SIZE                                0x1
#define _ANSELD_ANSELD3_LENGTH                              0x1
#define _ANSELD_ANSELD3_MASK                                0x8
#define _ANSELD_ANSELD4_POSN                                0x4
#define _ANSELD_ANSELD4_POSITION                            0x4
#define _ANSELD_ANSELD4_SIZE                                0x1
#define _ANSELD_ANSELD4_LENGTH                              0x1
#define _ANSELD_ANSELD4_MASK                                0x10
#define _ANSELD_ANSELD5_POSN                                0x5
#define _ANSELD_ANSELD5_POSITION                            0x5
#define _ANSELD_ANSELD5_SIZE                                0x1
#define _ANSELD_ANSELD5_LENGTH                              0x1
#define _ANSELD_ANSELD5_MASK                                0x20
#define _ANSELD_ANSELD6_POSN                                0x6
#define _ANSELD_ANSELD6_POSITION                            0x6
#define _ANSELD_ANSELD6_SIZE                                0x1
#define _ANSELD_ANSELD6_LENGTH                              0x1
#define _ANSELD_ANSELD6_MASK                                0x40
#define _ANSELD_ANSELD7_POSN                                0x7
#define _ANSELD_ANSELD7_POSITION                            0x7
#define _ANSELD_ANSELD7_SIZE                                0x1
#define _ANSELD_ANSELD7_LENGTH                              0x1
#define _ANSELD_ANSELD7_MASK                                0x80

// Register: WPUD
#define WPUD WPUD
extern volatile unsigned char           WPUD                __at(0x3A71);
#ifndef _LIB_BUILD
asm("WPUD equ 03A71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUD0                  :1;
        unsigned WPUD1                  :1;
        unsigned WPUD2                  :1;
        unsigned WPUD3                  :1;
        unsigned WPUD4                  :1;
        unsigned WPUD5                  :1;
        unsigned WPUD6                  :1;
        unsigned WPUD7                  :1;
    };
} WPUDbits_t;
extern volatile WPUDbits_t WPUDbits __at(0x3A71);
// bitfield macros
#define _WPUD_WPUD0_POSN                                    0x0
#define _WPUD_WPUD0_POSITION                                0x0
#define _WPUD_WPUD0_SIZE                                    0x1
#define _WPUD_WPUD0_LENGTH                                  0x1
#define _WPUD_WPUD0_MASK                                    0x1
#define _WPUD_WPUD1_POSN                                    0x1
#define _WPUD_WPUD1_POSITION                                0x1
#define _WPUD_WPUD1_SIZE                                    0x1
#define _WPUD_WPUD1_LENGTH                                  0x1
#define _WPUD_WPUD1_MASK                                    0x2
#define _WPUD_WPUD2_POSN                                    0x2
#define _WPUD_WPUD2_POSITION                                0x2
#define _WPUD_WPUD2_SIZE                                    0x1
#define _WPUD_WPUD2_LENGTH                                  0x1
#define _WPUD_WPUD2_MASK                                    0x4
#define _WPUD_WPUD3_POSN                                    0x3
#define _WPUD_WPUD3_POSITION                                0x3
#define _WPUD_WPUD3_SIZE                                    0x1
#define _WPUD_WPUD3_LENGTH                                  0x1
#define _WPUD_WPUD3_MASK                                    0x8
#define _WPUD_WPUD4_POSN                                    0x4
#define _WPUD_WPUD4_POSITION                                0x4
#define _WPUD_WPUD4_SIZE                                    0x1
#define _WPUD_WPUD4_LENGTH                                  0x1
#define _WPUD_WPUD4_MASK                                    0x10
#define _WPUD_WPUD5_POSN                                    0x5
#define _WPUD_WPUD5_POSITION                                0x5
#define _WPUD_WPUD5_SIZE                                    0x1
#define _WPUD_WPUD5_LENGTH                                  0x1
#define _WPUD_WPUD5_MASK                                    0x20
#define _WPUD_WPUD6_POSN                                    0x6
#define _WPUD_WPUD6_POSITION                                0x6
#define _WPUD_WPUD6_SIZE                                    0x1
#define _WPUD_WPUD6_LENGTH                                  0x1
#define _WPUD_WPUD6_MASK                                    0x40
#define _WPUD_WPUD7_POSN                                    0x7
#define _WPUD_WPUD7_POSITION                                0x7
#define _WPUD_WPUD7_SIZE                                    0x1
#define _WPUD_WPUD7_LENGTH                                  0x1
#define _WPUD_WPUD7_MASK                                    0x80

