GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.h
// Register: DMA2SSZL
#define DMA2SSZL DMA2SSZL
extern volatile unsigned char           DMA2SSZL            __at(0x3BD7);
#ifndef _LIB_BUILD
asm("DMA2SSZL equ 03BD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned DMA2SSZ                :8;
    };
    struct {
        unsigned SSZ0                   :1;
        unsigned SSZ1                   :1;
        unsigned SSZ2                   :1;
        unsigned SSZ3                   :1;
        unsigned SSZ4                   :1;
        unsigned SSZ5                   :1;
        unsigned SSZ6                   :1;
        unsigned SSZ7                   :1;
    };
    struct {
        unsigned DMA2SSZ0               :1;
        unsigned DMA2SSZ1               :1;
        unsigned DMA2SSZ2               :1;
        unsigned DMA2SSZ3               :1;
        unsigned DMA2SSZ4               :1;
        unsigned DMA2SSZ5               :1;
        unsigned DMA2SSZ6               :1;
        unsigned DMA2SSZ7               :1;
    };
} DMA2SSZLbits_t;
extern volatile DMA2SSZLbits_t DMA2SSZLbits __at(0x3BD7);
// bitfield macros
#define _DMA2SSZL_SSZ_POSN                                  0x0
#define _DMA2SSZL_SSZ_POSITION                              0x0
#define _DMA2SSZL_SSZ_SIZE                                  0x8
#define _DMA2SSZL_SSZ_LENGTH                                0x8
#define _DMA2SSZL_SSZ_MASK                                  0xFF
#define _DMA2SSZL_DMA2SSZ_POSN                              0x0
#define _DMA2SSZL_DMA2SSZ_POSITION                          0x0
#define _DMA2SSZL_DMA2SSZ_SIZE                              0x8
#define _DMA2SSZL_DMA2SSZ_LENGTH                            0x8
#define _DMA2SSZL_DMA2SSZ_MASK                              0xFF
#define _DMA2SSZL_SSZ0_POSN                                 0x0
#define _DMA2SSZL_SSZ0_POSITION                             0x0
#define _DMA2SSZL_SSZ0_SIZE                                 0x1
#define _DMA2SSZL_SSZ0_LENGTH                               0x1
#define _DMA2SSZL_SSZ0_MASK                                 0x1
#define _DMA2SSZL_SSZ1_POSN                                 0x1
#define _DMA2SSZL_SSZ1_POSITION                             0x1
#define _DMA2SSZL_SSZ1_SIZE                                 0x1
#define _DMA2SSZL_SSZ1_LENGTH                               0x1
#define _DMA2SSZL_SSZ1_MASK                                 0x2
#define _DMA2SSZL_SSZ2_POSN                                 0x2
#define _DMA2SSZL_SSZ2_POSITION                             0x2
#define _DMA2SSZL_SSZ2_SIZE                                 0x1
#define _DMA2SSZL_SSZ2_LENGTH                               0x1
#define _DMA2SSZL_SSZ2_MASK                                 0x4
#define _DMA2SSZL_SSZ3_POSN                                 0x3
#define _DMA2SSZL_SSZ3_POSITION                             0x3
#define _DMA2SSZL_SSZ3_SIZE                                 0x1
#define _DMA2SSZL_SSZ3_LENGTH                               0x1
#define _DMA2SSZL_SSZ3_MASK                                 0x8
#define _DMA2SSZL_SSZ4_POSN                                 0x4
#define _DMA2SSZL_SSZ4_POSITION                             0x4
#define _DMA2SSZL_SSZ4_SIZE                                 0x1
#define _DMA2SSZL_SSZ4_LENGTH                               0x1
#define _DMA2SSZL_SSZ4_MASK                                 0x10
#define _DMA2SSZL_SSZ5_POSN                                 0x5
#define _DMA2SSZL_SSZ5_POSITION                             0x5
#define _DMA2SSZL_SSZ5_SIZE                                 0x1
#define _DMA2SSZL_SSZ5_LENGTH                               0x1
#define _DMA2SSZL_SSZ5_MASK                                 0x20
#define _DMA2SSZL_SSZ6_POSN                                 0x6
#define _DMA2SSZL_SSZ6_POSITION                             0x6
#define _DMA2SSZL_SSZ6_SIZE                                 0x1
#define _DMA2SSZL_SSZ6_LENGTH                               0x1
#define _DMA2SSZL_SSZ6_MASK                                 0x40
#define _DMA2SSZL_SSZ7_POSN                                 0x7
#define _DMA2SSZL_SSZ7_POSITION                             0x7
#define _DMA2SSZL_SSZ7_SIZE                                 0x1
#define _DMA2SSZL_SSZ7_LENGTH                               0x1
#define _DMA2SSZL_SSZ7_MASK                                 0x80
#define _DMA2SSZL_DMA2SSZ0_POSN                             0x0
#define _DMA2SSZL_DMA2SSZ0_POSITION                         0x0
#define _DMA2SSZL_DMA2SSZ0_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ0_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ0_MASK                             0x1
#define _DMA2SSZL_DMA2SSZ1_POSN                             0x1
#define _DMA2SSZL_DMA2SSZ1_POSITION                         0x1
#define _DMA2SSZL_DMA2SSZ1_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ1_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ1_MASK                             0x2
#define _DMA2SSZL_DMA2SSZ2_POSN                             0x2
#define _DMA2SSZL_DMA2SSZ2_POSITION                         0x2
#define _DMA2SSZL_DMA2SSZ2_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ2_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ2_MASK                             0x4
#define _DMA2SSZL_DMA2SSZ3_POSN                             0x3
#define _DMA2SSZL_DMA2SSZ3_POSITION                         0x3
#define _DMA2SSZL_DMA2SSZ3_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ3_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ3_MASK                             0x8
#define _DMA2SSZL_DMA2SSZ4_POSN                             0x4
#define _DMA2SSZL_DMA2SSZ4_POSITION                         0x4
#define _DMA2SSZL_DMA2SSZ4_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ4_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ4_MASK                             0x10
#define _DMA2SSZL_DMA2SSZ5_POSN                             0x5
#define _DMA2SSZL_DMA2SSZ5_POSITION                         0x5
#define _DMA2SSZL_DMA2SSZ5_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ5_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ5_MASK                             0x20
#define _DMA2SSZL_DMA2SSZ6_POSN                             0x6
#define _DMA2SSZL_DMA2SSZ6_POSITION                         0x6
#define _DMA2SSZL_DMA2SSZ6_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ6_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ6_MASK                             0x40
#define _DMA2SSZL_DMA2SSZ7_POSN                             0x7
#define _DMA2SSZL_DMA2SSZ7_POSITION                         0x7
#define _DMA2SSZL_DMA2SSZ7_SIZE                             0x1
#define _DMA2SSZL_DMA2SSZ7_LENGTH                           0x1
#define _DMA2SSZL_DMA2SSZ7_MASK                             0x80

