GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x3FFD);
#ifndef _LIB_BUILD
asm("TOSL equ 03FFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x3FFD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x3FFE);
#ifndef _LIB_BUILD
asm("TOSH equ 03FFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0x3FFE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0x3FFF);
#ifndef _LIB_BUILD
asm("TOSU equ 03FFFh");
#endif

/*
 * Register Mirrors in DMA Space
 */

// Register: IOCAF
#define                                 IOCAF_M1            0x4060
// Register: IOCBF
#define                                 IOCBF_M1            0x4061
// Register: IOCCF
#define                                 IOCCF_M1            0x4062
// Register: IOCEF
#define                                 IOCEF_M1            0x4063
// Register: ADLTHL
#define                                 ADLTHL_M1           0x4080
// Register: ADLTHH
#define                                 ADLTHH_M1           0x4081
// Register: ADUTHL
#define                                 ADUTHL_M1           0x4082
// Register: ADUTHH
#define                                 ADUTHH_M1           0x4083
// Register: ADERRL
#define                                 ADERRL_M1           0x4084
// Register: ADERRH
#define                                 ADERRH_M1           0x4085
// Register: ADSTPTL
#define                                 ADSTPTL_M1          0x4086
// Register: ADSTPTH
#define                                 ADSTPTH_M1          0x4087
// Register: ADFLTRL
#define                                 ADFLTRL_M1          0x4088
// Register: ADFLTRH
#define                                 ADFLTRH_M1          0x4089
// Register: ADACCL
#define                                 ADACCL_M1           0x408A
// Register: ADACCH
#define                                 ADACCH_M1           0x408B
// Register: ADACCU
#define                                 ADACCU_M1           0x408C
// Register: ADCNT
#define                                 ADCNT_M1            0x408D
// Register: ADRPT
#define                                 ADRPT_M1            0x408E
// Register: ADPREVL
#define                                 ADPREVL_M1          0x408F
// Register: ADPREVH
#define                                 ADPREVH_M1          0x4090
// Register: ADACQL
#define                                 ADACQL_M1           0x4091
// Register: ADACQH
#define                                 ADACQH_M1           0x4092
// Register: ADCAP
#define                                 ADCAP_M1            0x4093
// Register: ADPCH
#define                                 ADPCH_M1            0x4094
// Register: ADRESL
#define                                 ADRESL_M1           0x4095
// Register: ADRESH
#define                                 ADRESH_M1           0x4096
// Register: ADLTHL
#define                                 ADLTHL_M2           0x40A0
// Register: ADLTHH
#define                                 ADLTHH_M2           0x40A1
// Register: ADUTHL
#define                                 ADUTHL_M2           0x40A2
// Register: ADUTHH
#define                                 ADUTHH_M2           0x40A3
// Register: ADERRL
#define                                 ADERRL_M2           0x40A4
// Register: ADERRH
#define                                 ADERRH_M2           0x40A5
// Register: ADSTPTL
#define                                 ADSTPTL_M2          0x40A6
// Register: ADSTPTH
#define                                 ADSTPTH_M2          0x40A7
// Register: ADFLTRL
#define                                 ADFLTRL_M2          0x40A8
// Register: ADFLTRH
#define                                 ADFLTRH_M2          0x40A9
// Register: ADACCL
#define                                 ADACCL_M2           0x40AA
// Register: ADACCH
#define                                 ADACCH_M2           0x40AB
// Register: ADACCU
#define                                 ADACCU_M2           0x40AC
// Register: ADCNT
#define                                 ADCNT_M2            0x40AD
// Register: ADRPT
#define                                 ADRPT_M2            0x40AE
// Register: ADPREVL
#define                                 ADPREVL_M2          0x40AF
// Register: ADPREVH
#define                                 ADPREVH_M2          0x40B0
// Register: ADACQL
#define                                 ADACQL_M2           0x40B1
// Register: ADACQH
#define                                 ADACQH_M2           0x40B2
// Register: ADCAP
#define                                 ADCAP_M2            0x40B3
// Register: ADCON0
#define                                 ADCON0_M1           0x40B4
// Register: ADCON1
#define                                 ADCON1_M1           0x40B5
// Register: ADCON2
#define                                 ADCON2_M1           0x40B6
// Register: ADCON3
#define                                 ADCON3_M1           0x40B7
// Register: ADREF
#define                                 ADREF_M1            0x40B8
// Register: ADACT
#define                                 ADACT_M1            0x40B9
// Register: ADCLK
#define                                 ADCLK_M1            0x40BA
// Register: ADPCH
#define                                 ADPCH_M2            0x40BB
// Register: ADRESL
#define                                 ADRESL_M2           0x40BC
// Register: ADRESH
#define                                 ADRESH_M2           0x40BD
// Register: CCPR1L
#define                                 CCPR1L_M1           0x40C0
// Register: CCPR1H
#define                                 CCPR1H_M1           0x40C1
// Register: T2PR
#define                                 T2PR_M1             0x40C2
// Register: CCPR2L
#define                                 CCPR2L_M1           0x40C3
// Register: CCPR2H
#define                                 CCPR2H_M1           0x40C4
// Register: T2PR
#define                                 T2PR_M2             0x40C5
// Register: PWM5DCL
#define                                 PWM5DCL_M1          0x40C6
// Register: PWM5DCH
#define                                 PWM5DCH_M1          0x40C7
// Register: T2PR
#define                                 T2PR_M3             0x40C8
// Register: PWM6DCL
#define                                 PWM6DCL_M1          0x40C9
// Register: PWM6DCH
#define                                 PWM6DCH_M1          0x40CA
// Register: T2PR
#define                                 T2PR_M4             0x40CB
// Register: CCPR3L
#define                                 CCPR3L_M1           0x40CC
// Register: CCPR3H
#define                                 CCPR3H_M1           0x40CD
// Register: T4PR
#define                                 T4PR_M1             0x40CE
// Register: CCPR4L
#define                                 CCPR4L_M1           0x40CF
// Register: CCPR4H
#define                                 CCPR4H_M1           0x40D0
// Register: T4PR
#define                                 T4PR_M2             0x40D1
// Register: PWM7DCL
#define                                 PWM7DCL_M1          0x40D2
// Register: PWM7DCH
#define                                 PWM7DCH_M1          0x40D3
// Register: T4PR
#define                                 T4PR_M3             0x40D4
// Register: PWM8DCL
#define                                 PWM8DCL_M1          0x40D5
// Register: PWM8DCH
#define                                 PWM8DCH_M1          0x40D6
// Register: T4PR
#define                                 T4PR_M4             0x40D7
// Register: CCPR1L
#define                                 CCPR1L_M2           0x40D8
// Register: CCPR1H
#define                                 CCPR1H_M2           0x40D9
// Register: T6PR
#define                                 T6PR_M1             0x40DA
// Register: PWM5DCL
#define                                 PWM5DCL_M2          0x40DB
// Register: PWM5DCH
#define                                 PWM5DCH_M2          0x40DC
// Register: T6PR
#define                                 T6PR_M2             0x40DD
// Register: CCPR1L
#define                                 CCPR1L_M3           0x40E0
// Register: CCPR1H
#define                                 CCPR1H_M3           0x40E1
// Register: CCPR2L
#define                                 CCPR2L_M2           0x40E2
// Register: CCPR2H
#define                                 CCPR2H_M2           0x40E3
// Register: CCPR3L
#define                                 CCPR3L_M2           0x40E4
// Register: CCPR3H
#define                                 CCPR3H_M2           0x40E5
// Register: CCPR4L
#define                                 CCPR4L_M2           0x40E6
// Register: CCPR4H
#define                                 CCPR4H_M2           0x40E7
// Register: PWM5DCL
#define                                 PWM5DCL_M3          0x40E8
// Register: PWM5DCH
#define                                 PWM5DCH_M3          0x40E9
// Register: PWM6DCL
#define                                 PWM6DCL_M2          0x40EA
// Register: PWM6DCH
#define                                 PWM6DCH_M2          0x40EB
// Register: PWM7DCL
#define                                 PWM7DCL_M2          0x40EC
// Register: PWM7DCH
#define                                 PWM7DCH_M2          0x40ED
// Register: PWM8DCL
#define                                 PWM8DCL_M2          0x40EE
// Register: PWM8DCH
#define                                 PWM8DCH_M2          0x40EF
// Register: TMR1L
#define                                 TMR1L_M1            0x40F6
// Register: TMR1H
#define                                 TMR1H_M1            0x40F7
// Register: TMR3L
#define                                 TMR3L_M1            0x40F8
// Register: TMR3H
#define                                 TMR3H_M1            0x40F9
// Register: TMR5L
#define                                 TMR5L_M1            0x40FA
// Register: TMR5H
#define                                 TMR5H_M1            0x40FB
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// ADACCU<ACC20>
extern volatile __bit                   ACC20               __at(0x1F754);	// @ (0x3EEA * 8 + 4)
#define                                 ACC20_bit           _BIT_ACCESS(ADACCU,4)
// ADACCU<ACC21>
extern volatile __bit                   ACC21               __at(0x1F755);	// @ (0x3EEA * 8 + 5)
#define                                 ACC21_bit           _BIT_ACCESS(ADACCU,5)
// ADACCU<ACC22>
extern volatile __bit                   ACC22               __at(0x1F756);	// @ (0x3EEA * 8 + 6)
#define                                 ACC22_bit           _BIT_ACCESS(ADACCU,6)
// ADACCU<ACC23>
extern volatile __bit                   ACC23               __at(0x1F757);	// @ (0x3EEA * 8 + 7)
#define                                 ACC23_bit           _BIT_ACCESS(ADACCU,7)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x1CB44);	// @ (0x3968 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// I2C1PIE<ACKT1IE>
extern volatile __bit                   ACKT1IE             __at(0x1EBD6);	// @ (0x3D7A * 8 + 6)
#define                                 ACKT1IE_bit         _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKT1IF>
extern volatile __bit                   ACKT1IF             __at(0x1EBCE);	// @ (0x3D79 * 8 + 6)
#define                                 ACKT1IF_bit         _BIT_ACCESS(I2C1PIR,6)
// I2C2PIE<ACKT2IE>
extern volatile __bit                   ACKT2IE             __at(0x1EB26);	// @ (0x3D64 * 8 + 6)
#define                                 ACKT2IE_bit         _BIT_ACCESS(I2C2PIE,6)
// I2C2PIR<ACKT2IF>
extern volatile __bit                   ACKT2IF             __at(0x1EB1E);	// @ (0x3D63 * 8 + 6)
#define                                 ACKT2IF_bit         _BIT_ACCESS(I2C2PIR,6)
// ADCON2<ACLR>
extern volatile __bit                   ACLR                __at(0x1F7D3);	// @ (0x3EFA * 8 + 3)
#define                                 ACLR_bit            _BIT_ACCESS(ADCON2,3)
// ADACQL<ACQ0>
extern volatile __bit                   ACQ0                __at(0x1F798);	// @ (0x3EF3 * 8 + 0)
#define                                 ACQ0_bit            _BIT_ACCESS(ADACQL,0)
// ADACQL<ACQ1>
extern volatile __bit                   ACQ1                __at(0x1F799);	// @ (0x3EF3 * 8 + 1)
#define                                 ACQ1_bit            _BIT_ACCESS(ADACQL,1)
// ADACQH<ACQ10>
extern volatile __bit                   ACQ10               __at(0x1F7A2);	// @ (0x3EF4 * 8 + 2)
#define                                 ACQ10_bit           _BIT_ACCESS(ADACQH,2)
// ADACQH<ACQ11>
extern volatile __bit                   ACQ11               __at(0x1F7A3);	// @ (0x3EF4 * 8 + 3)
#define                                 ACQ11_bit           _BIT_ACCESS(ADACQH,3)
// ADACQH<ACQ12>
extern volatile __bit                   ACQ12               __at(0x1F7A4);	// @ (0x3EF4 * 8 + 4)
#define                                 ACQ12_bit           _BIT_ACCESS(ADACQH,4)
// ADACQL<ACQ2>
extern volatile __bit                   ACQ2                __at(0x1F79A);	// @ (0x3EF3 * 8 + 2)
#define                                 ACQ2_bit            _BIT_ACCESS(ADACQL,2)
// ADACQL<ACQ3>
extern volatile __bit                   ACQ3                __at(0x1F79B);	// @ (0x3EF3 * 8 + 3)
#define                                 ACQ3_bit            _BIT_ACCESS(ADACQL,3)
// ADACQL<ACQ4>
extern volatile __bit                   ACQ4                __at(0x1F79C);	// @ (0x3EF3 * 8 + 4)
#define                                 ACQ4_bit            _BIT_ACCESS(ADACQL,4)
// ADACQL<ACQ5>
extern volatile __bit                   ACQ5                __at(0x1F79D);	// @ (0x3EF3 * 8 + 5)
#define                                 ACQ5_bit            _BIT_ACCESS(ADACQL,5)
// ADACQL<ACQ6>
extern volatile __bit                   ACQ6                __at(0x1F79E);	// @ (0x3EF3 * 8 + 6)
#define                                 ACQ6_bit            _BIT_ACCESS(ADACQL,6)
// ADACQL<ACQ7>
extern volatile __bit                   ACQ7                __at(0x1F79F);	// @ (0x3EF3 * 8 + 7)
#define                                 ACQ7_bit            _BIT_ACCESS(ADACQL,7)
// ADACQH<ACQ8>
extern volatile __bit                   ACQ8                __at(0x1F7A0);	// @ (0x3EF4 * 8 + 0)
#define                                 ACQ8_bit            _BIT_ACCESS(ADACQH,0)
// ADACQH<ACQ9>
extern volatile __bit                   ACQ9                __at(0x1F7A1);	// @ (0x3EF4 * 8 + 1)
#define                                 ACQ9_bit            _BIT_ACCESS(ADACQH,1)
// ADACT<ACT0>
extern volatile __bit                   ACT0                __at(0x1F7F0);	// @ (0x3EFE * 8 + 0)
#define                                 ACT0_bit            _BIT_ACCESS(ADACT,0)
// ADACT<ACT1>
extern volatile __bit                   ACT1                __at(0x1F7F1);	// @ (0x3EFE * 8 + 1)
#define                                 ACT1_bit            _BIT_ACCESS(ADACT,1)
// ADACT<ACT2>
extern volatile __bit                   ACT2                __at(0x1F7F2);	// @ (0x3EFE * 8 + 2)
#define                                 ACT2_bit            _BIT_ACCESS(ADACT,2)
// ADACT<ACT3>
extern volatile __bit                   ACT3                __at(0x1F7F3);	// @ (0x3EFE * 8 + 3)
#define                                 ACT3_bit            _BIT_ACCESS(ADACT,3)
// ADACT<ACT4>
extern volatile __bit                   ACT4                __at(0x1F7F4);	// @ (0x3EFE * 8 + 4)
#define                                 ACT4_bit            _BIT_ACCESS(ADACT,4)
// ADACCL<ADACC0>
extern volatile __bit                   ADACC0              __at(0x1F740);	// @ (0x3EE8 * 8 + 0)
#define                                 ADACC0_bit          _BIT_ACCESS(ADACCL,0)
// ADACCL<ADACC1>
extern volatile __bit                   ADACC1              __at(0x1F741);	// @ (0x3EE8 * 8 + 1)
#define                                 ADACC1_bit          _BIT_ACCESS(ADACCL,1)
// ADACCH<ADACC10>
extern volatile __bit                   ADACC10             __at(0x1F74A);	// @ (0x3EE9 * 8 + 2)
#define                                 ADACC10_bit         _BIT_ACCESS(ADACCH,2)
// ADACCH<ADACC11>
extern volatile __bit                   ADACC11             __at(0x1F74B);	// @ (0x3EE9 * 8 + 3)
#define                                 ADACC11_bit         _BIT_ACCESS(ADACCH,3)
// ADACCH<ADACC12>
extern volatile __bit                   ADACC12             __at(0x1F74C);	// @ (0x3EE9 * 8 + 4)
#define                                 ADACC12_bit         _BIT_ACCESS(ADACCH,4)
// ADACCH<ADACC13>
extern volatile __bit                   ADACC13             __at(0x1F74D);	// @ (0x3EE9 * 8 + 5)
#define                                 ADACC13_bit         _BIT_ACCESS(ADACCH,5)
// ADACCH<ADACC14>
extern volatile __bit                   ADACC14             __at(0x1F74E);	// @ (0x3EE9 * 8 + 6)
#define                                 ADACC14_bit         _BIT_ACCESS(ADACCH,6)
// ADACCH<ADACC15>
extern volatile __bit                   ADACC15             __at(0x1F74F);	// @ (0x3EE9 * 8 + 7)
#define                                 ADACC15_bit         _BIT_ACCESS(ADACCH,7)
// ADACCU<ADACC16>
extern volatile __bit                   ADACC16             __at(0x1F750);	// @ (0x3EEA * 8 + 0)
#define                                 ADACC16_bit         _BIT_ACCESS(ADACCU,0)
// ADACCU<ADACC17>
extern volatile __bit                   ADACC17             __at(0x1F751);	// @ (0x3EEA * 8 + 1)
#define                                 ADACC17_bit         _BIT_ACCESS(ADACCU,1)
// ADACCU<ADACC18>
extern volatile __bit                   ADACC18             __at(0x1F752);	// @ (0x3EEA * 8 + 2)
#define                                 ADACC18_bit         _BIT_ACCESS(ADACCU,2)
// ADACCU<ADACC19>
extern volatile __bit                   ADACC19             __at(0x1F753);	// @ (0x3EEA * 8 + 3)
#define                                 ADACC19_bit         _BIT_ACCESS(ADACCU,3)
// ADACCL<ADACC2>
extern volatile __bit                   ADACC2              __at(0x1F742);	// @ (0x3EE8 * 8 + 2)
#define                                 ADACC2_bit          _BIT_ACCESS(ADACCL,2)
// ADACCU<ADACC20>
extern volatile __bit                   ADACC20             __at(0x1F754);	// @ (0x3EEA * 8 + 4)
#define                                 ADACC20_bit         _BIT_ACCESS(ADACCU,4)
// ADACCU<ADACC21>
extern volatile __bit                   ADACC21             __at(0x1F755);	// @ (0x3EEA * 8 + 5)
#define                                 ADACC21_bit         _BIT_ACCESS(ADACCU,5)
// ADACCU<ADACC22>
extern volatile __bit                   ADACC22             __at(0x1F756);	// @ (0x3EEA * 8 + 6)
#define                                 ADACC22_bit         _BIT_ACCESS(ADACCU,6)
// ADACCU<ADACC23>
extern volatile __bit                   ADACC23             __at(0x1F757);	// @ (0x3EEA * 8 + 7)
#define                                 ADACC23_bit         _BIT_ACCESS(ADACCU,7)
// ADACCL<ADACC3>
extern volatile __bit                   ADACC3              __at(0x1F743);	// @ (0x3EE8 * 8 + 3)
#define                                 ADACC3_bit          _BIT_ACCESS(ADACCL,3)
// ADACCL<ADACC4>
extern volatile __bit                   ADACC4              __at(0x1F744);	// @ (0x3EE8 * 8 + 4)
#define                                 ADACC4_bit          _BIT_ACCESS(ADACCL,4)
// ADACCL<ADACC5>
extern volatile __bit                   ADACC5              __at(0x1F745);	// @ (0x3EE8 * 8 + 5)
#define                                 ADACC5_bit          _BIT_ACCESS(ADACCL,5)
// ADACCL<ADACC6>
extern volatile __bit                   ADACC6              __at(0x1F746);	// @ (0x3EE8 * 8 + 6)
#define                                 ADACC6_bit          _BIT_ACCESS(ADACCL,6)
// ADACCL<ADACC7>
extern volatile __bit                   ADACC7              __at(0x1F747);	// @ (0x3EE8 * 8 + 7)
#define                                 ADACC7_bit          _BIT_ACCESS(ADACCL,7)
// ADACCH<ADACC8>
extern volatile __bit                   ADACC8              __at(0x1F748);	// @ (0x3EE9 * 8 + 0)
#define                                 ADACC8_bit          _BIT_ACCESS(ADACCH,0)
// ADACCH<ADACC9>
extern volatile __bit                   ADACC9              __at(0x1F749);	// @ (0x3EE9 * 8 + 1)
#define                                 ADACC9_bit          _BIT_ACCESS(ADACCH,1)
// ADCON2<ADACLR>
extern volatile __bit                   ADACLR              __at(0x1F7D3);	// @ (0x3EFA * 8 + 3)
#define                                 ADACLR_bit          _BIT_ACCESS(ADCON2,3)
// ADACQL<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x1F798);	// @ (0x3EF3 * 8 + 0)
#define                                 ADACQ0_bit          _BIT_ACCESS(ADACQL,0)
// ADACQL<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x1F799);	// @ (0x3EF3 * 8 + 1)
#define                                 ADACQ1_bit          _BIT_ACCESS(ADACQL,1)
// ADACQH<ADACQ10>
extern volatile __bit                   ADACQ10             __at(0x1F7A2);	// @ (0x3EF4 * 8 + 2)
#define                                 ADACQ10_bit         _BIT_ACCESS(ADACQH,2)
// ADACQH<ADACQ11>
extern volatile __bit                   ADACQ11             __at(0x1F7A3);	// @ (0x3EF4 * 8 + 3)
#define                                 ADACQ11_bit         _BIT_ACCESS(ADACQH,3)
// ADACQH<ADACQ12>
extern volatile __bit                   ADACQ12             __at(0x1F7A4);	// @ (0x3EF4 * 8 + 4)
#define                                 ADACQ12_bit         _BIT_ACCESS(ADACQH,4)
// ADACQL<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x1F79A);	// @ (0x3EF3 * 8 + 2)
#define                                 ADACQ2_bit          _BIT_ACCESS(ADACQL,2)
// ADACQL<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x1F79B);	// @ (0x3EF3 * 8 + 3)
#define                                 ADACQ3_bit          _BIT_ACCESS(ADACQL,3)
// ADACQL<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x1F79C);	// @ (0x3EF3 * 8 + 4)
#define                                 ADACQ4_bit          _BIT_ACCESS(ADACQL,4)
// ADACQL<ADACQ5>
extern volatile __bit                   ADACQ5              __at(0x1F79D);	// @ (0x3EF3 * 8 + 5)
#define                                 ADACQ5_bit          _BIT_ACCESS(ADACQL,5)
// ADACQL<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x1F79E);	// @ (0x3EF3 * 8 + 6)
#define                                 ADACQ6_bit          _BIT_ACCESS(ADACQL,6)
// ADACQL<ADACQ7>
extern volatile __bit                   ADACQ7              __at(0x1F79F);	// @ (0x3EF3 * 8 + 7)
#define                                 ADACQ7_bit          _BIT_ACCESS(ADACQL,7)
// ADACQH<ADACQ8>
extern volatile __bit                   ADACQ8              __at(0x1F7A0);	// @ (0x3EF4 * 8 + 0)
